{}{}{
    "@context": "http://schema.org/",
    "@type": "Product",
    "name": "Canon EOS R50 RF-S18-45mm F4.5-6.3 IS STM Lens Kit (Black) Mirrorless Camera",
    "mpn": "5811C012",
    "sku": "64075492",
    "description": "\n24.2 Megapixel CMOS (APS-C) sensor\n4K uncropped movie at up to 30 fps oversampled from 6K\nDual Pixel CMOS AF II\nMovie for Close-up Demo Mode\n12 fps Electronic First Curtain and 15 fps Electronic Shutter Continuous shooting\nAdvanced A+ Assist with expanded array of auto-compatible scenes\nLonger than 30min video recording\nUVC/UAC compatibility for webcam and streaming\n\nIn the Box\n\nEOS R50 Body (BK)\nCamera Cover R-F-5\nNeck Strap EM-200DB\nBattery Charger LC-E17\nBattery Pack LP-E17\nBattery Pack Cover\nRF-S18-45mm F4.5-6.3 IS STM\nLens Cap E-49\nLens Dust Cap\nRF Shoe Cover\n \n",
    "aggregateRating": {
        "@type": "AggregateRating",
        "ratingValue": 4,
        "reviewCount": 13
    },
    "brand": {
        "@type": "Brand",
        "name": "Canon"
    },
    "gtin12": "013803351415",
    "image": [
        "https://www.nfm.com/dw/image/v2/BDFM_PRD/on/demandware.static/-/Sites-nfm-master-catalog/default/dw761964be/images/064/07/64075492-1.jpg?sw=1000&sh=1000&sm=fit",
        "https://www.nfm.com/dw/image/v2/BDFM_PRD/on/demandware.static/-/Sites-nfm-master-catalog/default/dw6d5f8649/images/064/07/64075492-2.jpg?sw=1000&sh=1000&sm=fit",
        "https://www.nfm.com/dw/image/v2/BDFM_PRD/on/demandware.static/-/Sites-nfm-master-catalog/default/dw680712ca/images/064/07/64075492-3.jpg?sw=1000&sh=1000&sm=fit",
        "https://www.nfm.com/dw/image/v2/BDFM_PRD/on/demandware.static/-/Sites-nfm-master-catalog/default/dw0bd5a952/images/064/07/64075492-4.jpg?sw=1000&sh=1000&sm=fit",
        "https://www.nfm.com/dw/image/v2/BDFM_PRD/on/demandware.static/-/Sites-nfm-master-catalog/default/dw8f3eeb0e/images/064/07/64075492-5.jpg?sw=1000&sh=1000&sm=fit",
        "https://www.nfm.com/dw/image/v2/BDFM_PRD/on/demandware.static/-/Sites-nfm-master-catalog/default/dw9f2ae4fc/images/064/07/64075492-6.jpg?sw=1000&sh=1000&sm=fit"
    ],
    "offers": {
        "url": {},
        "@type": "Offer",
        "priceCurrency": "USD",
        "price": "799.99",
        "availability": "http://schema.org/InStock"
    },
    "@id": "64075492"
}{}{}{
    "@context": "http://schema.org/",
    "@type": "Product",
    "name": "Canon EOS R50 RF-S18-45mm F4.5-6.3 IS STM Lens Kit (Black) Mirrorless Camera",
    "id": "5205-64075492-en_US",
    "aggregateRating": {
        "@type": "AggregateRating",
        "ratingValue": 4.15,
        "reviewCount": 13
    },
    "review": [
        {
            "@type": "Review",
            "name": "In new condition.",
            "reviewBody": "Received camera in brand new condition. Favorite past time! Love it.",
            "datePublished": "2024-05-29T14:39:21.000Z",
            "author": {
                "@type": "Person",
                "name": "Daryl Z"
            },
            "locationCreated": {
                "@type": "AdministrativeArea",
                "name": "New York"
            },
            "reviewRating": {
                "@type": "Rating",
                "ratingValue": 5
            }
        },
        {
            "@type": "Review",
            "name": "Great \"beginner\" camera for a good price.",
            "reviewBody": "I love my r50 so far, I'm a photography beginner who mostly just took pictures on their phone but wanted something more dedicated and higher quality. For my first \"real\" camera I think it meets my needs perfectly and I'm very impressed by it. I still need to learn how to get better at shooting manual but everything about it so far has been great, easy to learn, and easy to use. Despite being refurbished my camera arrived looking and working like it was brand new with zero signs of use at all which was lovely to see considering buying refurbished was a much better deal than going with new. No complaints from me right now :)",
            "datePublished": "2024-05-26T06:53:02.000Z",
            "author": {
                "@type": "Person",
                "name": "Olive D"
            },
            "locationCreated": {
                "@type": "AdministrativeArea",
                "name": "Kentucky"
            },
            "reviewRating": {
                "@type": "Rating",
                "ratingValue": 5
            }
        },
        {
            "@type": "Review",
            "name": "refurbished 18 to 150 mm lens",
            "reviewBody": "refurbished 18 to 150 mm lens is as expected as a lens retooled by Canon. Works great",
            "datePublished": "2024-04-14T22:10:16.000Z",
            "author": {
                "@type": "Person",
                "name": "craftman"
            },
            "locationCreated": {
                "@type": "AdministrativeArea",
                "name": "44121"
            },
            "reviewRating": {
                "@type": "Rating",
                "ratingValue": 5
            }
        },
        {
            "@type": "Review",
            "name": "Great camera with room for firmware improvements",
            "reviewBody": "The R50 is an amazing little camera. It packs great image quality and video recording features into a small body. For my skill level, it has features and options beyond what I currently need. The flip-out screen is a very useful feature and worth the extra cost over cheaper models. Unfortunately, there are some firmware glitches that need to be addressed. Controlling the camera via WiFi fails on some Android devices (notable Pixel devices, but also Asus phones). This could be the phone's fault, but that is of course no help to you as the user (phone manufacturers won't address an issue you have with a 3rd party device).",
            "datePublished": "2024-04-12T01:22:54.000Z",
            "author": {
                "@type": "Person",
                "name": "Charles_1859"
            },
            "locationCreated": {
                "@type": "AdministrativeArea",
                "name": "undisclosed"
            },
            "reviewRating": {
                "@type": "Rating",
                "ratingValue": 4
            }
        },
        {
            "@type": "Review",
            "name": "Love the camera and the kit lens!!!",
            "reviewBody": "I've had this for about 3 months now and absolutely love it.  This is exactly what I wanted; it's small, light weight, easy to use, has all the functions I could ask for, and it takes amazing photos!  The camera and the lens are much better than what I expected for the price, I can not imagine what else a person could want at this price point.  I love the flip-around screen that can be tucked away for safe keeping.  The thing that has sold me more than anything on this little mirrorless is the viewfinder.  The viewfinder is phenomenal, it literally looks better than real life.  A few years ago I had a camera with a digital viewfinder and I did not like it at all.  The technology for the viewfinders has now caught up to where it should be and it's awesome!  One very minor negative about the whole package is that it is so small and compact, the buttons can be a bit hard to use.  If you're wearing gloves it might be hopeless...",
            "datePublished": "2024-03-31T01:47:30.000Z",
            "author": {
                "@type": "Person",
                "name": "MTW3"
            },
            "locationCreated": {
                "@type": "AdministrativeArea",
                "name": "Tucson, AZ"
            },
            "reviewRating": {
                "@type": "Rating",
                "ratingValue": 5
            }
        },
        {
            "@type": "Review",
            "name": "Obsessed",
            "reviewBody": "I am obsessed with this camera. Super easy to use, and great photos! It's great for beginners!",
            "datePublished": "2024-03-30T01:14:21.000Z",
            "author": {
                "@type": "Person",
                "name": "MusEmma"
            },
            "locationCreated": {
                "@type": "AdministrativeArea",
                "name": "Washington DC"
            },
            "reviewRating": {
                "@type": "Rating",
                "ratingValue": 5
            }
        },
        {
            "@type": "Review",
            "name": "I have taken this camera all over... But...",
            "reviewBody": "The Canon EOS R50 is the bargain of the camera world for most people it's perfect for the \"I wanna get into photography\" or just taking better pictures then a phone or a parent that wants nice photos of the kiddo. For me the things I love about it are its lightness the tilt flip screen the on switch location the dial location and feel and build it feels good in the hand. I love the colors of my photos also canons color tech and sensor tech is really wonderful. I rarely ever have to edit my photos color-wise. The things I hate about it are that it for some insane reason it is not dust and weather-proof and as a landscape photographer in the pacific northwest that is a large flipping issue. I honestly when I got the camera didn't even bother checking to see if it was I assumed that all mirrorless cameras where now weather sealed and dust sealed to some extent cuz like all my mirrorless cameras I had owned or rented up to that point had that just built in. Huge L Canon. I have complained to cannon service about that and even told them they need to release a rain jacket or some kinda waterproof box for it. They politely declined to do that. Honestly This camera could have been my main camera for the next 5-10 years but without weather sealing I feel like imma want an upgrade after the summer is over and the rain really starts coming back in full force. Buy it for the Sensor and tech inside but just don't get it wet or dirty. The other major issue is that Cannons RF lenses have a little IR light inside them to confirm focus so my hope that one day I could convert this camera to IR and use the lenses I have is not possible and it feels like a huge bummer. If you are aware of this issue you might say well it doesn't have that big of effect at fast shutter speeds and I would say yeah but I wanna have a camera thats not limited to only shooting fast speeds.\n\nRF-S 18-45MM kit lens that came with my R50 is decent. It's got that image stabilization and thats the main reason I still use it cuz otherwise honestly it's a bit sad. It just feels like its missing something everything feels meh out of it there's no excitement or anything just a bit dull really. oh also for the 18mm side I use it for that also cuz im not putting more money in this camera system getting the RF 16mm if I can't one day use it for IR. It's also great for night shooting. Great for holding you over till you save up enough for a better lens. Also canon why in the world are you using plastic for your mount. PLZ STOP is the little metal bit that expensive to make? This lens is also not waterproof as it's not an L lens and doesn't get the fancy red ring. Once again as a landscape photographer in the pacific northwest that is a large issue Cannon takes the L on that. Maybe thats why canon has the L lenses cuz if your tired of taking L's you pay the big bucks...",
            "datePublished": "2024-03-14T21:16:13.000Z",
            "author": {
                "@type": "Person",
                "name": "Lumi"
            },
            "locationCreated": {
                "@type": "AdministrativeArea",
                "name": "Oregon"
            },
            "reviewRating": {
                "@type": "Rating",
                "ratingValue": 2
            }
        },
        {
            "@type": "Review",
            "name": "Wireless webcam software for streaming is terrible",
            "reviewBody": "Bought to use the wireless streaming with the EOS Webcam Pro subscription. It works at maybe 5 FPS and disconnects randomly.bought this to stream church service on Sundays and it's been a big let down",
            "datePublished": "2024-03-06T05:27:10.000Z",
            "author": {
                "@type": "Person",
                "name": "James at cpc"
            },
            "locationCreated": {
                "@type": "AdministrativeArea",
                "name": "Washington"
            },
            "reviewRating": {
                "@type": "Rating",
                "ratingValue": 2
            }
        },
        {
            "@type": "Review",
            "name": "No complaints here, great images and easy to use",
            "reviewBody": "Great camera for folks that want the quality of images that come from DSLR's without having to know how to use one.",
            "datePublished": "2024-03-03T17:47:10.000Z",
            "author": {
                "@type": "Person",
                "name": "Robert S S"
            },
            "locationCreated": {
                "@type": "AdministrativeArea",
                "name": "Charlotte, NC"
            },
            "reviewRating": {
                "@type": "Rating",
                "ratingValue": 5
            }
        },
        {
            "@type": "Review",
            "name": "Great Beginner Camera",
            "reviewBody": "As my first camera, I am happy with it after 3 months of use. I think it is a great teaching camera. I am learning a lot and feel like I can take the photos I want to take. It doesn't pressure me to buy new lens or a new body.  I get at a pretty good price the ability to take photos that surprise me. I recently was gifted a 16mm lens and that made me more addicted. I like the control rings too. The only consistent issue I have is when I am walking around with it in my hand sometimes I will trigger the shutter settings to take multiple photos at once or to the 3s timer option. I think something that makes this camera fun for me is the point and shoot ease with jpg. Eventually I did switch to raw and learned more about aperture and iso. The auto focus was really nice and I have played around with a few of the other modes. Video capture is good. I can't say too much about it but I do like the quality. The audio it captures is meh but I assume I will need actual mics and proper sound equipment because it tried to capture everything.  Overall great for my level of experience and I look forward to taking it with me as I travel",
            "datePublished": "2024-03-02T18:24:17.000Z",
            "author": {
                "@type": "Person",
                "name": "asimplenerd"
            },
            "locationCreated": {
                "@type": "AdministrativeArea",
                "name": "San Francisco"
            },
            "reviewRating": {
                "@type": "Rating",
                "ratingValue": 5
            }
        }
    ]
}